package lab4;

//3. Напишите программу, в которой создается двумерный массив, который выводи прямоугольник из цифр 2;
//
public class task3 {
    public static void main(String[] args) {

        for (int i = 1; i <6; i++) {
            for (int j = 1; j < 12; j++) {
                System.out.print("2 ");
            }
            System.out.println();
        }

    }
}
